<template>
    <div class="container pt-3">
        <h2 class="title">
            Прототип веб-приложения по реализации методики обеспечения безопасных доставок отправления на основе технологии блокчейн.
        </h2>
        <hr>
        <h4 class="mb-3">1.Пользователи </h4>
        <ul>
            <li>
                Админ - администратор веб-приложения имеет доступ ко всему <a href="#featuresSystem">функционалу системы (см. раздел 2).</a> <br>
                В задачи администратора в рамках методики будет входить:
                <ul>
                    <ol>1) Решение конфликтных ситуаций;</ol>    
                    <ol>2) создание блокчейнов в системе;</ol>    
                    <ol>3) контроль за целостностью блокчейнов и принятие соотвествующих мер в случаи нарушений целостности.</ol>    
                </ul> 
            </li>
            <li>
                Работник - работниками являются все участники процесса доставки отправления за исключением отправителя и получателя. Администратор системы тоже 
                является работником, только с более широким доступом к функционалу системы. Работник имеет ограниченный доступ к функционалу системы, а именно:
                <ul>
                    <ol>1) Просматривать список всех существующих блокчейнов(отправлений);</ol>
                    <ol>2) добавлять новый блок в блокчейн(единожды);</ol>
                    <ol>3) производить поиск блокчейна по ID блокчейна;</ol>
                    <ol>4) осуществлять просмотр целостности блокйчейнов;</ol>
                    <ol>5) просматривать документацию к системе.</ol>
                </ul>
                В рамках методики работником может являться и принимающий отправление и кладовщик и перевозчик и курьер и тд.
            </li>
            <li>
                Пользователь - участник системы с наименьщим доступом к функционалу системы. Пользотелю не обязательно проходить авторизацию в системе, поскольку функционалу
                системы не изменится. Пользователями являются отправитель и получатель. Пользователям системы доступен следующий функционал:
                <ul>
                    <ol>1) Произовдить поиск отправления;</ol>
                    <ol>2) осуществлять просмотр целостности данных в блокчейнах;</ol>
                    <ol>3) просмотр документации.</ol>
                </ul>
                В случаи если пользователь чем-либо недоволен в рамках процесса доставки отправления, он может обратиться за помощью к администратору.
            </li>
        </ul>

        <h4 class="mb-3" id="featuresSystem">
            2.Функционал системы
        </h4>
        <p>
            Функционал системы является масштабируемым, так как данное веб-приложение является прототипом методики обеспечения безопасных доставок отправлений
            , в нем представлена только самая важная часть функционала для общей демонстрации методики.
            <br>
            Функционал методики:
        </p>
            <ul>
                <ol>
                    1) Создание блокчейна под конкретное отправление;
                </ol>
                <ol>
                    2) создание блока для конкретного блокчейна, который будет хранить данные об отправлении и его состоянии,
                    отправителе, получателе и создателе текущего блока;
                </ol>
                <ol>
                    3) поиск конктретного блокчейна по его ID и детальный просмотр о блокчейне;
                </ol>
                <ol>
                    4) просмотр списка всех блокчейнов с краткой информацией по ним;
                </ol>
                <ol>
                    5) отслеживание целостности данных блокчейнов и состояний по каждому блоку
                </ol>
                <ol>
                    6) принудительное вмешательство в целостность данных 
                </ol>
                <ol>
                    7) авторизация пользователя
                </ol>
                <ol>
                    8) права доступа к функционалу системы для разных категорий пользователей
                </ol>
                <ol>
                    9) просмотр документации.
                </ol>
            </ul>
        <h4 class="mb-3" id="featuresSystem">
            3.Страницы веб-приложения
        </h4>
        <ul>
            <li>
                Главная - хранит информацию о разработчике. Страница доступна всем пользователям.
            </li>
            <li>
                Список блокчейнов - страница хранит данные по всем добавленным в систему блокчейнам. Страница доступна администратору и работнику.
            </li>
            <li>
                Внутренняя страница блокчейна - выводит подробные данные по конкретному блокчейну (данные о создателе данного блокчейна и данные о блоках добавленных в него). Страница доступ всем пользователям.
            </li>
            <li>
                Создать отправление - страница для создания отправления. Доступна администратору.
            </li>
            <li>
                Добавить блок - страница добавления блок в конкретный блокчейн. Доступна администратору и работнику.
            </li>
            <li>
                Поиск отправления - страница для поиска блокчейна и перехода на внутреннюю страницу конкретного блокчейна. Доступна всем пользователям.
            </li>
            <li>
                Целостность блокчейнов - страница которая на которую каждые 60 секунд выводятся результаты проверок целостности добавленных в систему блокчейнов. Доступна всем пользователям. Также на странице присутствуют два поля ввод "Введите номер блокчейна" и "Введите номер блока" - эти поля являются демонстрационным функционалом системы и служат для того чтобы произвести принудительное вмешательство в целостность данных блокчейна. Чтобы осуществить вмешательство вам нужно ввести данные по существующему блокчейну и блоку, после чего в выбранном блоке произойдет подмена данных и в проверке которая последует за изменениями данных можно будет увидеть что произошло нарушение целостности данных. В данном веб-приложении проверка целостности производится каждые 60 секунд, если брать за основу чеклист биткойна, то в него данные о целостности цепи добавляются каждые 10 минут. Такое короткое время выбрано для быстрой демонстрации результатов.
            </li>
            <li>
                Документация - информационная страница, которая хранит детальную информацию по эксплуатации системы.
            </li>
        </ul>
    </div>
</template>

<style scoped>
.title{
    text-align: center;
}

</style>